In [35]:
import pandas

movies = 'data/movielens/movies.csv'
users = 'data/movielens/users.csv'
ratings = 'data/movielens/ratings.csv'

m = pandas.read_csv(movies)
u = pandas.read_csv(users)
r = pandas.read_csv(ratings)

In [36]:
len(m.genres.unique())

301

In [37]:
m.genres.value_counts().head(10)

Drama             843
Comedy            521
Horror            178
Comedy|Drama      162
Comedy|Romance    142
Drama|Romance     134
Documentary       116
Thriller          101
Action             65
Drama|Thriller     63
Name: genres, dtype: int64

In [38]:
crt = m.loc[m.genres == 'Comedy|Romance|Thriller']
crt

     movie_id                                title                   genres
539       543  So I Married an Axe Murderer (1993)  Comedy|Romance|Thriller
583       587                         Ghost (1990)  Comedy|Romance|Thriller
921       933              To Catch a Thief (1955)  Comedy|Romance|Thriller

In [39]:
u.head()

   user_id gender  age  occupation    zip
0        1      F    1          10  48067
1        2      M   56          16  70072
2        3      M   25          15  55117
3        4      M   45           7  02460
4        5      M   25          20  55455

In [40]:
len(m), len(u), len(r)

(3883, 6040, 1000209)

In [41]:
m.loc[m.movie_id == 661]

     movie_id                             title                        genres
655       661  James and the Giant Peach (1996)  Animation|Children's|Musical

In [42]:
pandas.merge(m,r).head()

,movie_id,title,genres,user_id,rating,timestamp
0,1,Toy Story (1995),Animation|Children's|Comedy,1,5,978824268
1,1,Toy Story (1995),Animation|Children's|Comedy,6,4,978237008
2,1,Toy Story (1995),Animation|Children's|Comedy,8,4,978233496
3,1,Toy Story (1995),Animation|Children's|Comedy,9,5,978225952
4,1,Toy Story (1995),Animation|Children's|Comedy,10,5,978226474

In [43]:
mr = pandas.merge(m,r)
df = pandas.merge(mr,u)
df.head()

,movie_id,title,genres,user_id,rating,timestamp,gender,age,occupation,zip
0,1,Toy Story (1995),Animation|Children's|Comedy,1,5,978824268,F,1,10,48067
1,48,Pocahontas (1995),Animation|Children's|Musical|Romance,1,5,978824351,F,1,10,48067
2,150,Apollo 13 (1995),Drama,1,5,978301777,F,1,10,48067
3,260,Star Wars: Episode IV - A New Hope (1977),Action|Adventure|Fantasy|Sci-Fi,1,4,978300760,F,1,10,48067
4,527,Schindler's List (1993),Drama|War,1,5,978824195,F,1,10,48067

In [44]:
len(df.loc[df.age == 1])

27211

In [45]:
df.age.value_counts().head(1)

25    395556
Name: age, dtype: int64

In [46]:
len(df.loc[df.age < 35])

606303

In [47]:
len(df.loc[(df.gender == 'F') & (df.age < 35)])

145594

In [48]:
len(df.loc[(df.gender == 'M') & (df.age < 35)])

460709

In [49]:
five = df.loc[df.rating== 5]
five.title.value_counts().head(10)

American Beauty (1999)                                   1963
Star Wars: Episode IV - A New Hope (1977)                1826
Raiders of the Lost Ark (1981)                           1500
Star Wars: Episode V - The Empire Strikes Back (1980)    1483
Godfather, The (1972)                                    1475
Schindler's List (1993)                                  1475
Shawshank Redemption, The (1994)                         1457
Matrix, The (1999)                                       1430
Saving Private Ryan (1998)                               1405
Sixth Sense, The (1999)                                  1385
Name: title, dtype: int64

In [50]:
five.genres.value_counts().head(5)

Drama             29815
Comedy            22719
Comedy|Drama      10998
Comedy|Romance     8091
Drama|Romance      6176
Name: genres, dtype: int64

In [51]:
gender_age = df[['gender','age']]
gender_age.head()

  gender  age
0      F    1
1      F    1
2      F    1
3      F    1
4      F    1

In [54]:
df2 = df.groupby('title')
avgr = df2[['rating']].mean()
avgr.head()

                                 rating
title
$1,000,000 Duck (1971)         3.027027
'Night Mother (1986)           3.371429
'Til There Was You (1997)      2.692308
'burbs, The (1989)             2.910891
...And Justice for All (1979)  3.713568